Autodesk.Revit.DB.ImportInstance.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,Autodesk.Revit.DB.ExternalResourceReference,Autodesk.Revit.DB.ImportOptions3DM,Autodesk.Revit.DB.LinkLoadResult@)
Creates a new instance of 3DM link type from an external resource reference
and loads the linked file.
Remarks:
This function creates a new 3DM link type as well as a new instance of this 3DM link type.
The new instance of 3DM link type is returned by this function and the element id of the new 3DM link type
is contained in the LinkLoadResult.
If the given external resource reference of the 3DM link is already used by an existing 3DM link type,
a new instance of this existing 3DM link type is created and returned. The element id of the existing
3DM link type is contained in the LinkLoadResult.
This function regenerates the input document.
document:
The document in which to create the 3DM link.
DBView:
The view into which the 3DM link will be created.
resourceReference:
The external resource reference describing the source of the 3DM link.
options:
Various import options applicable to the 3DM format.
If null, all options will be set to their respective default values.
linkLoadResult:
An object containing the results of creating and loading
the 3DM link. It contains the ElementId of the new created 3DM link type.
Returns:
The new instance of 3DM link type created.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
document is in an edit mode.
-or-
Import is temporarily disabled.
-or-
The view is not printable.
-or-
ThisViewOnly cannot be true when importing a DWG|DGN drawing into a 3D view.
-or-
One or more strings describing layer selection is invalid or empty.
-or-
The scale is not valid as a CustomScale for use during import.
-or-
The server referenced by the ExternalResourceReference does not exist or
does not implement IExternalResourceServer.
-or-
The server referenced by the ExternalResourceReference cannot support CAD links.
-or-
The ExternalResourceReference (resourceReference) is not in a format
that is supported by its server.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The 3DM Import/Link module is not available in the installed Revit.
Since:
2022

Autodesk.Revit.DB.ImportInstance.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,Autodesk.Revit.DB.ExternalResourceReference,Autodesk.Revit.DB.STLImportOptions,Autodesk.Revit.DB.LinkLoadResult@)
Creates a new instance of STL link type from an external resource reference
and loads the linked file.
Remarks:
This function creates a new STL link type as well as a new instance of this STL link type.
The new instance of STL link type is returned by this function and the element id of the new STL link type
is contained in the LinkLoadResult.
If the given external resource reference of the STL link is already used by an existing STL link type,
a new instance of this existing STL link type is created and returned. The element id of the existing
STL link type is contained in the LinkLoadResult.
This function regenerates the input document.
document:
The document in which to create the STL link.
DBView:
The view into which the STL link will be created.
resourceReference:
The external resource reference describing the source of the STL link.
options:
Various import options applicable to the STL format.
If null, all options will be set to their respective default values.
linkLoadResult:
An object containing the results of creating and loading
the STL link. It contains the ElementId of the new created STL link type.
Returns:
The new instance of STL link type created.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
document is in an edit mode.
-or-
Import is temporarily disabled.
-or-
The view is not printable.
-or-
ThisViewOnly cannot be true when importing a DWG|DGN drawing into a 3D view.
-or-
One or more strings describing layer selection is invalid or empty.
-or-
The scale is not valid as a CustomScale for use during import.
-or-
The server referenced by the ExternalResourceReference does not exist or
does not implement IExternalResourceServer.
-or-
The server referenced by the ExternalResourceReference cannot support CAD links.
-or-
The ExternalResourceReference (resourceReference) is not in a format
that is supported by its server.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The STL Import/Link module is not available in the installed Revit.
Since:
2023

Autodesk.Revit.DB.ImportInstance.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,Autodesk.Revit.DB.ExternalResourceReference,Autodesk.Revit.DB.SKPImportOptions,Autodesk.Revit.DB.LinkLoadResult@)
Creates a new instance of SKP link type from an external resource reference
and loads the linked file.
Remarks:
This function creates a new SKP link type as well as a new instance of this SKP link type.
The new instance of SKP link type is returned by this function and the element id of the new SKP link type
is contained in the LinkLoadResult.
If the given external resource reference of the SKP link is already used by an existing SKP link type,
a new instance of this existing SKP link type is created and returned. The element id of the existing
SKP link type is contained in the LinkLoadResult.
This function regenerates the input document.
document:
The document in which to create the SKP link.
DBView:
The view into which the SKP link will be created.
resourceReference:
The external resource reference describing the source of the SKP link.
options:
Various import options applicable to the SKP format.
If null, all options will be set to their respective default values.
linkLoadResult:
An object containing the results of creating and loading
the SKP link. It contains the ElementId of the new created SKP link type.
Returns:
The new instance of SKP link type created.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
document is in an edit mode.
-or-
Import is temporarily disabled.
-or-
The view is not printable.
-or-
ThisViewOnly cannot be true when importing a DWG|DGN drawing into a 3D view.
-or-
One or more strings describing layer selection is invalid or empty.
-or-
The scale is not valid as a CustomScale for use during import.
-or-
The server referenced by the ExternalResourceReference does not exist or
does not implement IExternalResourceServer.
-or-
The server referenced by the ExternalResourceReference cannot support CAD links.
-or-
The ExternalResourceReference (resourceReference) is not in a format
that is supported by its server.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The SKP Import/Link module is not available in the installed Revit.
Since:
2018

Autodesk.Revit.DB.ImportInstance.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,Autodesk.Revit.DB.ExternalResourceReference,Autodesk.Revit.DB.SATImportOptions,Autodesk.Revit.DB.LinkLoadResult@)
Creates a new instance of SAT link type from an external resource reference
and loads the linked file.
Remarks:
This function creates a new SAT link type as well as a new instance of this SAT link type.
The new instance of SAT link type is returned by this function and the element id of the new SAT link type
is contained in the LinkLoadResult.
If the given external resource reference of the DWG link is already used by an existing SAT link type,
a new instance of this existing SAT link type is created and returned. The element id of the existing
SAT link type is contained in the LinkLoadResult.
This function regenerates the input document.
document:
The document in which to create the SAT link.
DBView:
The view into which the SAT link will be created.
resourceReference:
The external resource reference describing the source of the DGN link.
options:
Various import options applicable to the SAT format.
If null, all options will be set to their respective default values.
linkLoadResult:
An object containing the results of creating and loading
the SAT link. It contains the ElementId of the new created SAT link type.
Returns:
The new instance of SAT link type created.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
document is in an edit mode.
-or-
Import is temporarily disabled.
-or-
The view is not printable.
-or-
ThisViewOnly cannot be true when importing a DWG|DGN drawing into a 3D view.
-or-
One or more strings describing layer selection is invalid or empty.
-or-
The scale is not valid as a CustomScale for use during import.
-or-
The server referenced by the ExternalResourceReference does not exist or
does not implement IExternalResourceServer.
-or-
The server referenced by the ExternalResourceReference cannot support CAD links.
-or-
The ExternalResourceReference (resourceReference) is not in a format
that is supported by its server.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The SAT Import/Link module is not available in the installed Revit.
Since:
2018

Autodesk.Revit.DB.ImportInstance.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,Autodesk.Revit.DB.ExternalResourceReference,Autodesk.Revit.DB.OBJImportOptions,Autodesk.Revit.DB.LinkLoadResult@)
Creates a new instance of OBJ link type from an external resource reference
and loads the linked file.
Remarks:
This function creates a new OBJ link type as well as a new instance of this OBJ link type.
The new instance of OBJ link type is returned by this function and the element id of the new OBJ link type
is contained in the LinkLoadResult.
If the given external resource reference of the OBJ link is already used by an existing OBJ link type,
a new instance of this existing OBJ link type is created and returned. The element id of the existing
OBJ link type is contained in the LinkLoadResult.
This function regenerates the input document.
document:
The document in which to create the OBJ link.
DBView:
The view into which the OBJ link will be created.
resourceReference:
The external resource reference describing the source of the OBJ link.
options:
Various import options applicable to the OBJ format.
If null, all options will be set to their respective default values.
linkLoadResult:
An object containing the results of creating and loading
the OBJ link. It contains the ElementId of the new created OBJ link type.
Returns:
The new instance of OBJ link type created.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
document is in an edit mode.
-or-
Import is temporarily disabled.
-or-
The view is not printable.
-or-
ThisViewOnly cannot be true when importing a DWG|DGN drawing into a 3D view.
-or-
One or more strings describing layer selection is invalid or empty.
-or-
The scale is not valid as a CustomScale for use during import.
-or-
The server referenced by the ExternalResourceReference does not exist or
does not implement IExternalResourceServer.
-or-
The server referenced by the ExternalResourceReference cannot support CAD links.
-or-
The ExternalResourceReference (resourceReference) is not in a format
that is supported by its server.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The OBJ Import/Link module is not available in the installed Revit.
Since:
2023

Autodesk.Revit.DB.ImportInstance.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,Autodesk.Revit.DB.ExternalResourceReference,Autodesk.Revit.DB.DGNImportOptions,Autodesk.Revit.DB.LinkLoadResult@)
Creates a new instance of DGN link type from an external resource reference
and loads the linked file.
Remarks:
This function creates a new DGN link type as well as a new instance of this DGN link type.
The new instance of DGN link type is returned by this function and the element id of the new DGN link type
is contained in the LinkLoadResult.
If the given external resource reference of the DWG link is already used by an existing DGN link type,
a new instance of this existing DGN link type is created and returned. The element id of the existing
DGN link type is contained in the LinkLoadResult.
This function regenerates the input document.
document:
The document in which to create the DGN link.
DBView:
The view into which the DGN link will be created.
resourceReference:
The external resource reference describing the source of the DGN link.
options:
Various import options applicable to the DGN format.
If null, all options will be set to their respective default values.
linkLoadResult:
An object containing the results of creating and loading
the DGN link. It contains the ElementId of the new created DGN link type.
Returns:
The new instance of DGN link type created.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
document is in an edit mode.
-or-
Import is temporarily disabled.
-or-
The view is not printable.
-or-
ThisViewOnly cannot be true when importing a DWG|DGN drawing into a 3D view.
-or-
One or more strings describing layer selection is invalid or empty.
-or-
The scale is not valid as a CustomScale for use during import.
-or-
The server referenced by the ExternalResourceReference does not exist or
does not implement IExternalResourceServer.
-or-
The server referenced by the ExternalResourceReference cannot support CAD links.
-or-
The ExternalResourceReference (resourceReference) is not in a format
that is supported by its server.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The DGN Import/Link module is not available in the installed Revit.
Since:
2018

Autodesk.Revit.DB.ImportInstance.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.View)
Creates a new instance of an existing DWG link type.
Remarks:
This function regenerates the input document.
document:
The document in which to create the new instacne of DWG link type.
typeId:
The element id of the existing DWG link type.
DBView:
The view into which the new instance of DWG link type will be created.
Returns:
The new instance of the given DWG link type.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
document is in an edit mode.
-or-
The view is not printable.
-or-
The element id is not of a valid CADLinkType.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2018

Autodesk.Revit.DB.ImportInstance.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,Autodesk.Revit.DB.ExternalResourceReference,Autodesk.Revit.DB.DWGImportOptions,Autodesk.Revit.DB.LinkLoadResult@)
Creates a new instance of DWG link type from an external resource reference
and loads the linked file.
Remarks:
This function creates a new DWG link type as well as a new instance of this DWG link type.
The new instance of DWG link type is returned by this function and the element id of the new DWG link type
is contained in the LinkLoadResult.
If the given external resource reference of the DWG link is already used by an existing DWG link type,
a new instance of this existing DWG link type is created and returned. The element id of the existing
DWG link type is contained in the LinkLoadResult.
This function regenerates the input document.
document:
The document in which to create the DWG link.
DBView:
The view into which the DWG link will be created.
resourceReference:
The external resource reference describing the source of the DWG link.
options:
Various import options applicable to the DWG format.
If null, all options will be set to their respective default values.
linkLoadResult:
An object containing the results of creating and loading
the DWG link. It contains the ElementId of the new created DWG link type.
Returns:
The new instance of DWG link type created.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
document is in an edit mode.
-or-
Import is temporarily disabled.
-or-
The view is not printable.
-or-
ThisViewOnly cannot be true when importing a DWG|DGN drawing into a 3D view.
-or-
One or more strings describing layer selection is invalid or empty.
-or-
The line weights are not valid; either it contains an invalid number of line weights, or a line weight outside the valid range.
-or-
The scale is not valid as a CustomScale for use during import.
-or-
The server referenced by the ExternalResourceReference does not exist or
does not implement IExternalResourceServer.
-or-
The server referenced by the ExternalResourceReference cannot support CAD links.
-or-
The ExternalResourceReference (resourceReference) is not in a format
that is supported by its server.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The DWG Import/Link module is not available in the installed Revit.
Since:
2018

Autodesk.Revit.DB.ImportInstance.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,System.String,Autodesk.Revit.DB.DWGImportOptions,Autodesk.Revit.DB.LinkLoadResult@)
Creates a new instance of DWG or DXF link type from a file path and loads the linked file.
Remarks:
This function creates a new DWG or DXF link type as well as a new instance of this link type.
The new instance of DWG or DXF link type is returned by this function and the element id of the new DWG
or DXF link type is contained in the LinkLoadResult.
If the given full path of the DWG or DXF file to link is already used by an existing DWG or DXF link type,
a new instance of this existing DWG or DXF link type will be created and returned. The element id of the existing
DWG or DXF link type is contained in the LinkLoadResult.
This function regenerates the input document.
document:
The document in which to create the DWG or DXF link.
DBView:
The view into which the DWG or DXF link will be created.
path:
The full path of the DWG or DXF file to link. The path must exist and must be a valid DWG or DXF file.
options:
Various import options applicable to the DWG format.
If null, all options will be set to their respective default values.
linkLoadResult:
An object containing the results of creating and loading
the DWG or DXF link. It contains the ElementId of the new created DWG or DXF link type.
Returns:
The new instance of DWG or DXF link type.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
document is in an edit mode.
-or-
Import is temporarily disabled.
-or-
The view is not printable.
-or-
NullOrEmpty
-or-
Not a valid file for DWG import (.dwg and .dxf files are valid).
-or-
ThisViewOnly cannot be true when importing a DWG|DGN drawing into a 3D view.
-or-
One or more strings describing layer selection is invalid or empty.
-or-
The line weights are not valid; either it contains an invalid number of line weights, or a line weight outside the valid range.
-or-
The scale is not valid as a CustomScale for use during import.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given path does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Place by shared, and the host model and the link do not share the same coordinate system.
Or place by shared, and the shared coordinates of the host model do not match the GIS coordinate system of the link.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The DWG Import/Link module is not available in the installed Revit.
Since:
2018